In [33]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [6]:
data = [4, 7, -5, 3]
pd_data = pd.Series(data)
pd_data

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
data = [4, 7, -5, 3]
index = ["한남", "대학","평생","학습"]
pd_data = pd.Series(data)
pd_data2 = pd.Series(data, index)
pd_data2

한남    4
대학    7
평생   -5
학습    3
dtype: int64

In [8]:
print(pd_data2)
print(pd_data2["대학"])

한남    4
대학    7
평생   -5
학습    3
dtype: int64
7

In [9]:
pd_data2[pd_data2 > 0]

한남    4
대학    7
학습    3
dtype: int64

In [10]:
pd_data2*2

한남     8
대학    14
평생   -10
학습     6
dtype: int64

In [11]:
"학습" in pd_data2

True

In [12]:
"빅데" in pd_data2

False

In [16]:
data = {"status" : ["Ohio", "Ohio","Ohio","Nevada","Nevada","Nevada"],
       "year" : ["2000","2001","2002","2001","2002","2003"],
       "pop" : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

   status  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [17]:
frame.head(3)

  status  year  pop
0   Ohio  2000  1.5
1   Ohio  2001  1.7
2   Ohio  2002  3.6

In [18]:
frame.tail(2)

   status  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [20]:
frame2 = pd.DataFrame(data, columns=["year", "status", "sales", "pop"],
                     index = ["No1","No2","No3","No4","No5","No6"])
frame2

     year  status sales  pop
No1  2000    Ohio   NaN  1.5
No2  2001    Ohio   NaN  1.7
No3  2002    Ohio   NaN  3.6
No4  2001  Nevada   NaN  2.4
No5  2002  Nevada   NaN  2.9
No6  2003  Nevada   NaN  3.2

In [21]:
frame2["pop"] # 열 꺼낼 때

No1    1.5
No2    1.7
No3    3.6
No4    2.4
No5    2.9
No6    3.2
Name: pop, dtype: float64

In [22]:
frame2.pop

<bound method DataFrame.pop of      year  status sales  pop
No1  2000    Ohio   NaN  1.5
No2  2001    Ohio   NaN  1.7
No3  2002    Ohio   NaN  3.6
No4  2001  Nevada   NaN  2.4
No5  2002  Nevada   NaN  2.9
No6  2003  Nevada   NaN  3.2>

In [24]:
frame2.loc["No4"] # 행 꺼낼 때

year        2001
status    Nevada
sales        NaN
pop          2.4
Name: No4, dtype: object

In [26]:
frame2["sales"] = 0
frame2

     year  status  sales  pop
No1  2000    Ohio      0  1.5
No2  2001    Ohio      0  1.7
No3  2002    Ohio      0  3.6
No4  2001  Nevada      0  2.4
No5  2002  Nevada      0  2.9
No6  2003  Nevada      0  3.2

In [37]:
frame2["sales"] = np.arange(6)
frame2

     year  status  sales  pop
No1  2000    Ohio      0  1.5
No2  2001    Ohio      1  1.7
No3  2002    Ohio      2  3.6
No4  2001  Nevada      3  2.4
No5  2002  Nevada      4  2.9
No6  2003  Nevada      5  3.2

In [40]:
frame2["sales"] = [100, 200, 300, 400, 500, 600]
frame2

     year  status  sales  pop
No1  2000    Ohio    100  1.5
No2  2001    Ohio    200  1.7
No3  2002    Ohio    300  3.6
No4  2001  Nevada    400  2.4
No5  2002  Nevada    500  2.9
No6  2003  Nevada    600  3.2

In [38]:
index = ["No1","No2","No3","No4","No5","No6"]
ser = pd.Series([100, 200, 300, 400, 500, 600], index)
frame2["sales"] = ser
frame2

     year  status  sales  pop
No1  2000    Ohio    100  1.5
No2  2001    Ohio    200  1.7
No3  2002    Ohio    300  3.6
No4  2001  Nevada    400  2.4
No5  2002  Nevada    500  2.9
No6  2003  Nevada    600  3.2

In [41]:
index = ["No1","No2","No3","No4","No5","No6"]
ser = pd.Series([100, 200, 300, 400, 500, 600], index)
frame2["additional"] = ser
frame2

     year  status  sales  pop  additional
No1  2000    Ohio    100  1.5         100
No2  2001    Ohio    200  1.7         200
No3  2002    Ohio    300  3.6         300
No4  2001  Nevada    400  2.4         400
No5  2002  Nevada    500  2.9         500
No6  2003  Nevada    600  3.2         600

In [42]:
del frame2["additional"]
frame2

     year  status  sales  pop
No1  2000    Ohio    100  1.5
No2  2001    Ohio    200  1.7
No3  2002    Ohio    300  3.6
No4  2001  Nevada    400  2.4
No5  2002  Nevada    500  2.9
No6  2003  Nevada    600  3.2

In [43]:
frame2.T # 전치 >> 칼럼과 로우 바꿈

         No1   No2   No3     No4     No5     No6
year    2000  2001  2002    2001    2002    2003
status  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
sales    100   200   300     400     500     600
pop      1.5   1.7   3.6     2.4     2.9     3.2

In [45]:
pop_data = {"Nevada" : {2001 : 2.4, 2002 : 2.9},
            "Ohio" : {2000 : 1.5, 2001 : 1.7, 2002 : 3.6}}

In [47]:
frame2 = pd.DataFrame(pop_data, index=[2000, 2001, 2002, 2003])
frame2

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [53]:
frame2.index.name = "year"
frame2.columns.name = "state"
frame2

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [55]:
frame2.index

Int64Index([2000, 2001, 2002], dtype='int64', name='year')

In [56]:
frame2.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [57]:
frame2.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [58]:
frame2 = frame2.reindex([2000,2001, 2002])
frame2

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [59]:
frame4 = pd.Series(["blue","puple","yellow"], index = [0,2,4])
print(frame4)

0      blue
2     puple
4    yellow
dtype: object

In [60]:
frame4

0      blue
2     puple
4    yellow
dtype: object

In [66]:
frame5 = frame4.reindex(index = [0,1,2,3,4], method = "ffill")
frame5

0      blue
1      blue
2     puple
3     puple
4    yellow
dtype: object